In [1]:
import pandas as pd

## 1. Series
It is a one-dimensional labeled array caplable of holding any data type.

In [15]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])
s

a    3
b   -5
c    7
d    4
dtype: int64

## 2. DataFrame
it is a two-dimensional labeled data structure with columns of potentially different types.

In [20]:
data = {'country': ['Belgium', 'India', 'Brazil'], 
        'capital': ['Brussels', 'New Delhi', 'Brasilia'], 
        'Population': [11190846, 1303171035, 207847528]}
# df = pd.DataFrame(data, index=['a', 'b', 'c'], columns=['country', 'capital', 'Population'])
df = pd.DataFrame(data)
df

   country    capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

## 3. IO

In [ ]:
# Read and write to CSV
# pd.read_csv('file.csv', header=None, nrows=5)
# pd.to_csv('myDataFrame.csv')

In [ ]:
# Read and write to Excel
# pd.read_excel('file.xlsx')
# pd.read.to_excel('dir/myDataFrame.xlsx', sheet_name='Sheet1')
# xlsx =pd.ExcelFile('file.xlsx')
# df = pd.read_excel(xlsx, 'Sheet1')

## 4. Selection

In [9]:
s['b']

-5

In [10]:
df[1:]

  country    capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasilia   207847528

In [14]:
df.iloc[0:1, :]

   country   capital  Population
0  Belgium  Brussels    11190846

In [4]:
df = pd.DataFrame({"a": [4, 5, 6],
                   "b": [7, 8, 9],
                   "c": [10, 11, 12]},
                    index = [1, 2, 3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [5]:
df = pd.DataFrame([[4, 5, 6],
                   [7, 8, 9],
                   [10, 11, 12]],
                    index = [1, 2, 3],
                    columns = ['a', 'b', 'c'])
df

    a   b   c
1   4   5   6
2   7   8   9
3  10  11  12